
// Shelf Navigation Title at the top of the main Issues List
"SHELF_NAVIGATION_TITLE" = "Baker Shelf";

// Products alert
"PRODUCTS_REQUEST_FAILED_TITLE" = "Failure connecting to the App Store";
"PRODUCTS_REQUEST_FAILED_CLOSE" = "Close";

// Info button
"INFO_BUTTON_TEXT" = "Info";

// Subscription button
"SUBSCRIBE_BUTTON_TEXT" = "Subscribe";
"SUBSCRIBE_BUTTON_DISABLED_TEXT" = "Subscribing...";
"SUBSCRIBE_BUTTON_SUBSCRIBED_TEXT" = "Subscribed";

"SUBSCRIPTIONS_SHEET_FREE" = "Subscribe for free";
"SUBSCRIPTIONS_SHEET_RESTORE" = "Restore purchases";
"SUBSCRIPTIONS_SHEET_CLOSE" = "Close";

"SUBSCRIPTIONS_SHEET_GENERIC" = "Subscription options";
"SUBSCRIPTIONS_SHEET_SUBSCRIBED" = "You are subscribed";
"SUBSCRIPTIONS_SHEET_NOT_SUBSCRIBED" = "You are not subscribed";

// Subscription alerts
"SUBSCRIPTION_SUCCESSFUL_TITLE" = "Subscribed successfully";
"SUBSCRIPTION_SUCCESSFUL_MESSAGE" = "You have successfully subscribed";
"SUBSCRIPTION_SUCCESSFUL_CLOSE" = "Close";
"SUBSCRIPTION_FAILED_TITLE" = "Subscription failure";
"SUBSCRIPTION_FAILED_CLOSE" = "Close";

// Issue purchase alerts
"ISSUE_PURCHASE_SUCCESSFUL_TITLE" = "Purchase successful";
"ISSUE_PURCHASE_SUCCESSFUL_MESSAGE" = "You have successfully purchased %@";
"ISSUE_PURCHASE_SUCCESSFUL_CLOSE" = "Close";
"ISSUE_PURCHASE_FAILED_TITLE" = "Purchase failure";
"ISSUE_PURCHASE_FAILED_CLOSE" = "Close";

// Restore alerts
"RESTORE_FAILED_TITLE" = "Restore failure";
"RESTORE_FAILED_CLOSE" = "Close";

"RESTORED_ISSUE_NOT_RECOGNISED_TITLE" = "Some issues could not be restored";
"RESTORED_ISSUE_NOT_RECOGNISED_MESSAGE" = "The following product IDs are not defined and the corresponding issues could not be restored:\n%@.\n\nContact the app creator for more info.";
"RESTORED_ISSUE_NOT_RECOGNISED_CLOSE" = "Close";

// Download alert
"DOWNLOAD_FAILED_TITLE" = "Download failed";
"DOWNLOAD_FAILED_MESSAGE" = "The issue could not be downloaded";
"DOWNLOAD_FAILED_CLOSE" = "Close";

// Unzip alert
"UNZIP_FAILED_TITLE" = "Opening failed";
"UNZIP_FAILED_MESSAGE" = "The issue could not be opened";
"UNZIP_FAILED_CLOSE" = "Close";

// Connection alert
"INTERNET_CONNECTION_UNAVAILABLE_TITLE" = "No Internet Connection";
"INTERNET_CONNECTION_UNAVAILABLE_MESSAGE" = "An Internet connection is unavailable. Some features of this application require an active connection.";
"INTERNET_CONNECTION_UNAVAILABLE_CLOSE" = "OK";

// Issue buttons
"ACTION_REMOTE_TEXT" = "DOWNLOAD";
"ACTION_DOWNLOADED_TEXT" = "READ";
"ACTION_BUY_TEXT" = "BUY";
"ARCHIVE_TEXT" = "ARCHIVE";
"CONNECTING_TEXT" = "CONNECTING...";
"DOWNLOADING_TEXT" = "DOWNLOADING ...";
"OPENING_TEXT" = "Loading...";
"BUYING_TEXT" = "BUYING...";
"RETRIEVING_TEXT" = "UPDATING PRICE...";

// Issue states
"FREE_TEXT" = "FREE";
"PURCHASED_TEXT" = "PURCHASED";

// Archiving alert
"ARCHIVE_ALERT_TITLE" = "Are you sure you want to archive this issue?";
"ARCHIVE_ALERT_MESSAGE" = "This issue will be removed from your device. You may download it at anytime for free.";
"ARCHIVE_ALERT_BUTTON_CANCEL" = "Cancel";
"ARCHIVE_ALERT_BUTTON_OK" = "Archive";

// Mail alert
"MAILTO_ALERT_TITLE" = "Failure";
"MAILTO_ALERT_MESSAGE" = "Your device doesn't support the sending of emails!";
"MAILTO_ALERT_CLOSE" = "OK";

// Modal web view
"WEB_MODAL_FAILURE_MESSAGE" = "Unable to connect.";
"WEB_MODAL_CLOSE_BUTTON_TEXT" = "Back";

// Transaction recording alert
"TRANSACTION_RECORDING_FAILED_TITLE" = "Could not confirm purchase with remote server";
"TRANSACTION_RECORDING_FAILED_MESSAGE" = "The operation will be retried until it is successful";
"TRANSACTION_RECORDING_FAILED_CLOSE" = "Close";

// Issue opening failure alert
"ISSUE_OPENING_FAILED_TITLE" = "Could not open issue";
"ISSUE_OPENING_FAILED_MESSAGE" = "There was an error opening this issue. Try downloading it again or contact the publisher.";
"ISSUE_OPENING_FAILED_CLOSE" = "Close";

// Subscriptions
// (These are just examples: you'll need to provide your own product IDs and names)
//"com.example.MyBook.subscription.3months" = "3 Months Subscription";
//"com.example.MyBook.subscription.6months" = "Half Year Subscription";
